InformationRegisters/Renault_BP_ШаблоныДокументовРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_BP_ШаблоныДокументовРезультатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_БонусныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_BP_ШаблоныДокументовРезультатов/Ext/ManagerModule.bsl
Процедура ДобавитьШаблон(Кампания, ДвоичныеДанные) Экспорт

	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Шаблон = Новый ХранилищеЗначения(ДвоичныеДанные);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьШаблон(Кампания) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.Шаблон.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура УдалитьШаблон(Кампания) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Удалить();	
	
КонецПроцедуры
